1. Write a Python program to count the number of vowels in a given string.

In [2]:
 
def count_vowels(text):
    vowels = "aeiou"
    count = 0
    for char in text.lower():
        if char in vowels:
            count += 1
    return count
 
# Example
print(count_vowels("Artificial Intelligence"))

10

2. Write a Python program to check whether a given string is a palindrome.

In [3]:
def is_palindrome(text):
    # Step 1: Convert the input text to lowercase
    lower_text = text.lower()
    
    # Step 2: Reverse the lowercase text
    reversed_text = lower_text[::-1]
    
    # Step 3: Compare the original and reversed text
    if lower_text == reversed_text:
        return True
    else:
        return False
 
 
# Example usage
result1 = is_palindrome("madam")
print(result1)   # True
 
result2 = is_palindrome("python")
print(result2)   # False

True
False

3. Write a Python program to check whether two strings are anagrams.

In [4]:
def is_anagram(str1, str2):
    # Step 1: Convert both strings to lowercase
    string1 = str1.lower()
    string2 = str2.lower()
    
    # Step 2: Sort the characters of both strings
    sorted_string1 = sorted(string1)
    sorted_string2 = sorted(string2)
    
    # Step 3: Compare the sorted character lists
    if sorted_string1 == sorted_string2:
        return True
    else:
        return False
 
 
# Example usage
result1 = is_anagram("listen", "silent")
print(result1)   # True
 
result2 = is_anagram("hello", "world")
print(result2)   # False

True
False

Common & Basic Pandas Uses

1. Importing pandas

In [3]:
import pandas as pd

2. Load data

In [55]:
df = pd.read_csv('/home/amma/Downloads/titanic.csv') # Load CSV

In [14]:
df = pd.read_excel('/home/amma/Downloads/Historicalinvesttemp.xlsx') # Load Excel

3. View Data

In [57]:
df.head() # First 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [58]:

df.tail() # Last 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [59]:
df.sample(3) # Random 3 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
598,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.2250,NaN,C
756,757,0,3,"Carlsson, Mr. August Sigfrid",male,28.0,0,0,350042,7.7958,NaN,S
189,190,0,3,"Turcin, Mr. Stjepan",male,36.0,0,0,349247,7.8958,NaN,S

4. Inspect Structure

In [60]:
df.shape # Rows and columns

(891, 12)

In [61]:
df.columns # Column names

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [62]:
df.info() # Data types and nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [63]:


df.describe() # Summary stats

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

5. Handling Missing Data

In [64]:
df.isnull().sum() # Count nulls

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [66]:
df['Age'].fillna(df['Age'].mean(), inplace=True) # Fill with mean

/tmp/ipykernel_6975/2238352095.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True) # Fill with mean

In [67]:
df.isnull().sum() # Count nulls

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [68]:
df.dropna(inplace=True) # Drop rows with any nulls

In [69]:
df.isnull().sum() # Count nulls

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

6. Removing Duplicates

In [70]:
df.duplicated().sum()

np.int64(0)

In [71]:
df.drop_duplicates(inplace=True)

7. Selecting Columns

In [72]:
df['Name'] # Single column (Series)

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
6                                McCarthy, Mr. Timothy J
10                       Sandstrom, Miss. Marguerite Rut
11                              Bonnell, Miss. Elizabeth
                             ...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872                             Carlsson, Mr. Frans Olof
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
887                         Graham, Miss. Margaret Edith
889                                Behr, Mr. Karl Howell
Name: Name, Length: 202, dtype: object

In [73]:
df[['Name', 'Age']] # Multiple columns

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
6                              McCarthy, Mr. Timothy J  54.0
10                     Sandstrom, Miss. Marguerite Rut   4.0
11                            Bonnell, Miss. Elizabeth  58.0
..                                                 ...   ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0
872                           Carlsson, Mr. Frans Olof  33.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
887                       Graham, Miss. Margaret Edith  19.0
889                              Behr, Mr. Karl Howell  26.0

[202 rows x 2 columns]

8. Filtering Rows

In [74]:
df[df['Age'] > 30] # Age > 30

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

In [75]:
df[df['Sex'] == 'female'] # All females

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.000000,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.000000,0,0,113783,26.5500,C103,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,29.699118,1,0,PC 17569,146.5208,B78,C
...,...,...,...,...,...,...,...,...,...,...,...,...
853,854,1,1,"Lines, Miss. Mary Conover",female,16.000000,0,1,PC 17592,39.4000,D28,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.000000,0,0,17466,25.9292,D17,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.000000,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.000000,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S

In [23]:

 df[(df['Age'] > 30) & (df['Sex'] == 'male')] # Compound filter

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S
...,...,...,...,...,...,...,...,...,...,...,...,...
789,790,0,1,"Guggenheim, Mr. Benjamin",male,46.0,0,0,PC 17593,79.2000,B82 B84,C
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S

9. Sorting Data

In [76]:
df.sort_values(by='Age', ascending=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
183,184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S
205,206,0,3,"Strom, Miss. Telma Matilda",female,2.00,0,1,347054,10.4625,G6,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
340,341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
...,...,...,...,...,...,...,...,...,...,...,...,...
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.00,0,1,113509,61.9792,B30,C
456,457,0,1,"Millet, Mr. Francis Davis",male,65.00,0,0,13509,26.5500,E38,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.00,1,1,WE/P 5735,71.0000,B22,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S

In [77]:
df.sort_values(by=['Pclass', 'Fare'], ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.000000,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.000000,0,0,PC 17755,512.3292,B101,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.000000,3,2,19950,263.0000,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.000000,3,2,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.000000,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
429,430,1,3,"Pickard, Mr. Berk (Berk Trembisky)",male,32.000000,0,0,SOTON/O.Q. 392078,8.0500,E10,S
776,777,0,3,"Tobin, Mr. Roger",male,29.699118,0,0,383121,7.7500,F38,Q
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.000000,0,0,348123,7.6500,F G73,S
699,700,0,3,"Humblen, Mr. Adolf Mathias Nicolai Olsen",male,42.000000,0,0,348121,7.6500,F G63,S
715,716,0,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.000000,0,0,348124,7.6500,F G73,S

10. Creating New Columns

In [78]:
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1

In [79]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'FamilySize'],
      dtype='object')

11. Dropping Columns or Rows

In [80]:
df.drop('Ticket', axis=1, inplace=True) # Drop column

In [81]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Cabin', 'Embarked', 'FamilySize'],
      dtype='object')

In [82]:
print(df.index)

Index([  1,   3,   6,  10,  11,  21,  23,  27,  31,  52,
       ...
       849, 853, 857, 862, 867, 871, 872, 879, 887, 889],
      dtype='int64', length=202)

In [83]:
df.shape

(202, 12)

In [84]:
df.drop(df.index[[0, 1]], inplace=True)
 # Drop rows by index

In [85]:
df.shape

(200, 12)

In [86]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Cabin          0
Embarked       0
FamilySize     0
dtype: int64

12. Renaming Columns

In [87]:
df.rename(columns={'SibSp': 'SiblingsSpouses'}, inplace=True)

In [88]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SiblingsSpouses', 'Parch', 'Fare', 'Cabin', 'Embarked', 'FamilySize'],
      dtype='object')

13. Value Counts & Unique

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 200 entries, 6 to 889
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PassengerId      200 non-null    int64
 1   Survived         200 non-null    int64
 2   Pclass           200 non-null    int64
 3   Name             200 non-null    object
 4   Sex              200 non-null    object
 5   Age              200 non-null    float64
 6   SiblingsSpouses  200 non-null    int64
 7   Parch            200 non-null    int64
 8   Fare             200 non-null    float64
 9   Cabin            200 non-null    object
 10  Embarked         200 non-null    object
 11  FamilySize       200 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 20.3+ KB

In [90]:
df['Sex'].value_counts()

Sex
male      107
female     93
Name: count, dtype: int64

In [91]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [92]:

df['Embarked'].nunique()

3

14. Grouping and Aggregation

In [93]:
df.groupby('Pclass')['Fare'].mean()

Pclass
1    86.157462
2    18.063544
3    11.698608
Name: Fare, dtype: float64

In [94]:

df.groupby('Sex')['Survived'].sum()

Sex
female    87
male      45
Name: Survived, dtype: int64

In [95]:

df.groupby(['Pclass', 'Sex'])['Age'].median()

Pclass  Sex
1       female    32.000000
        male      37.000000
2       female    29.349559
        male      18.500000
3       female    25.500000
        male      27.349559
Name: Age, dtype: float64

15. Aggregating Multiple Columns

In [96]:
df.groupby('Pclass').agg({
'Age': ['mean', 'min'],
'Fare': ['max', 'mean']
})

              Age            Fare
             mean   min       max       mean
Pclass
1       36.869802  0.92  512.3292  86.157462
2       25.543695  1.00   39.0000  18.063544
3       22.449853  2.00   22.3583  11.698608

16. Apply Custom Functions

In [98]:
df['AgeSquared'] = df['Age'].apply(lambda x: x**2)
df['AgeSquared']

6      2916.0
10       16.0
11     3364.0
21     1156.0
23      784.0
        ...
871    2209.0
872    1089.0
879    3136.0
887     361.0
889     676.0
Name: AgeSquared, Length: 200, dtype: float64

 
17. String Operations

In [99]:
df['Name'].str.lower()

6                               mccarthy, mr. timothy j
10                      sandstrom, miss. marguerite rut
11                             bonnell, miss. elizabeth
21                                beesley, mr. lawrence
23                         sloper, mr. william thompson
                             ...
871    beckwith, mrs. richard leonard (sallie monypeny)
872                            carlsson, mr. frans olof
879       potter, mrs. thomas jr (lily alexenia wilson)
887                        graham, miss. margaret edith
889                               behr, mr. karl howell
Name: Name, Length: 200, dtype: object

In [100]:
df['Name'].str.contains('Mrs')

6      False
10     False
11     False
21     False
23     False
       ...
871     True
872    False
879     True
887    False
889    False
Name: Name, Length: 200, dtype: bool

 
18. Mapping & Replacing Values

In [101]:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [102]:
df['Sex'] = df['Sex'].str.strip().str.lower().map({'male': 0, 'female': 1})
df['Sex']

6      0
10     1
11     1
21     0
23     0
      ..
871    1
872    0
879    1
887    1
889    0
Name: Sex, Length: 200, dtype: int64

In [103]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [104]:
df['Embarked'].replace({'S': 'Southampton', 'C': 'Cherbourg'}, inplace=True)

19. Combining Columns (concatenation)

In [105]:
df['FullName'] = df['Name'] + ' (' + df['Sex'].astype(str) + ')'
df['FullName']

6                            McCarthy, Mr. Timothy J (0)
10                   Sandstrom, Miss. Marguerite Rut (1)
11                          Bonnell, Miss. Elizabeth (1)
21                             Beesley, Mr. Lawrence (0)
23                      Sloper, Mr. William Thompson (0)
                             ...
871    Beckwith, Mrs. Richard Leonard (Sallie Monypen...
872                         Carlsson, Mr. Frans Olof (0)
879    Potter, Mrs. Thomas Jr (Lily Alexenia Wilson) (1)
887                     Graham, Miss. Margaret Edith (1)
889                            Behr, Mr. Karl Howell (0)
Name: FullName, Length: 200, dtype: object

20. Merging DataFrames

In [106]:
df2 = pd.read_csv('/home/amma/Downloads/titanic 2.csv')

In [107]:
df2.head()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [110]:
df.shape

(200, 14)

In [111]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SiblingsSpouses,Parch,Fare,Cabin,Embarked,FamilySize,AgeSquared,FullName
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,51.8625,E46,Southampton,1,2916.0,"McCarthy, Mr. Timothy J (0)"
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",1,4.0,1,1,16.7000,G6,Southampton,3,16.0,"Sandstrom, Miss. Marguerite Rut (1)"
11,12,1,1,"Bonnell, Miss. Elizabeth",1,58.0,0,0,26.5500,C103,Southampton,1,3364.0,"Bonnell, Miss. Elizabeth (1)"
21,22,1,2,"Beesley, Mr. Lawrence",0,34.0,0,0,13.0000,D56,Southampton,1,1156.0,"Beesley, Mr. Lawrence (0)"
23,24,1,1,"Sloper, Mr. William Thompson",0,28.0,0,0,35.5000,A6,Southampton,1,784.0,"Sloper, Mr. William Thompson (0)"

In [108]:
df2.shape

(1309, 28)

In [114]:
merged_df = pd.merge(
    df,
    df2,
    left_on='PassengerId',
    right_on='Passengerid',
    how='left'
)

In [115]:
merged_df.head()

,PassengerId,Survived,Pclass_x,Name,Sex_x,Age_x,SiblingsSpouses,Parch_x,Fare_x,Cabin,...,zero.12,zero.13,zero.14,Pclass_y,zero.15,zero.16,Embarked_y,zero.17,zero.18,2urvived
0,7,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,51.8625,E46,...,0,0,0,1,0,0,2.0,0,0,0
1,11,1,3,"Sandstrom, Miss. Marguerite Rut",1,4.0,1,1,16.7000,G6,...,0,0,0,3,0,0,2.0,0,0,1
2,12,1,1,"Bonnell, Miss. Elizabeth",1,58.0,0,0,26.5500,C103,...,0,0,0,1,0,0,2.0,0,0,1
3,22,1,2,"Beesley, Mr. Lawrence",0,34.0,0,0,13.0000,D56,...,0,0,0,2,0,0,2.0,0,0,1
4,24,1,1,"Sloper, Mr. William Thompson",0,28.0,0,0,35.5000,A6,...,0,0,0,1,0,0,2.0,0,0,1

21. Concatenating DataFrames - Concatenation is used to combine two or more DataFrames along rows or columns when they have the same structure and no key-based matching is required.

In [117]:

df_combined = pd.concat([df, df2], axis=0) # Stack vertically

22. Pivot Table

In [119]:
 

pd.pivot_table(df, values='Fare', index='Pclass', columns='Sex', aggfunc='mean')

Sex             0           1
Pclass
1       72.815703  102.618074
2       23.812500   14.614170
3        8.537500   14.859717

23. Resetting and Setting Index

reset_index()	Remove old index
set_index()	Create meaningful index

In [120]:
df.reset_index(drop=True, inplace=True)
df.set_index('PassengerId', inplace=True)

24. Conditional Column Creation

In [121]:
df['AgeGroup'] = df['Age'].apply(lambda x: 'child' if x < 16 else 'adult')
df['AgeGroup']

PassengerId
7      adult
11     child
12     adult
22     adult
24     adult
       ...
872    adult
873    adult
880    adult
888    adult
890    adult
Name: AgeGroup, Length: 200, dtype: object

25. Save Cleaned Data

In [123]:


df.to_csv('cleaned_titanic.csv', index=False)
df.to_excel('cleaned_data.xlsx', index=False)